{
    "pageTextData": [
		{
			"title": "Coca Cola Great Britain",
			"subTitle": "Founded in 1886 Dr John S Pemberton",		
			"description": "The Coca Cola Company is the world's leading manufacturer, marketer and distributor of non-alcoholic beverage concentrates and syrups, and produces nearly 400 brands."
		},
		{
			"title": "Coca Cola",
			"subTitle": "New York Harbour, 1886",		
			"description": "It was 1886, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special!"
		},
		{
			"title": "Sprite",
			"subTitle": "West Germany, 1959",		
			"description": "First introduced in 1961, crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of our no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
		},
		{
			"title": "Dr Pepper",
			"subTitle": "Texas, 1885",		
			"description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885. The distinctive, bold taste of Dr Pepper has been popular ever since."
		},
		{
			"x3dModelTitle": "Coca Cola X3D Model",
			"x3dCreationMethod": "This X3D model of the coke can has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
			"title": "History of Coca Cola",
			"subTitle": "Atlanta Beginnings",		
			"description": "It was 1886, and in New York Harbour, workers were constructing the Statue of Liberty. Eight hundred miles away, another great American symbol was about to be unveiled. Like many people who change history, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, he carried it a few doors down to Jacobs' Pharmacy. Here, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special. So Jacobs' Pharmacy put it on sale for five cents (about 3p) a glass."
		},
		{
			"x3dModelTitle": "Sprite X3D Model",
			"x3dCreationMethod": "This X3D model of the sprite bottle has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
			"title": "Sprite — Fanta Klare Zitrone",
			"subTitle": "First introduced in 1961",		
			"description": "Crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of Coca Cola's no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
		},
		{
			"x3dModelTitle": "Macintosh X3D Model",
			"x3dCreationMethod": "This X3D model of the original Macintosh has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
			"title": "Macintosh — Designed in Cailfornia",
			"subTitle": "Released: 24 January 1984",		
			"description": "The Macintosh 128K, originally released as the Apple Macintosh, is the original Apple Macintosh personal computer. Its beige case consisted of a 9 in CRT monitor and came with a keyboard and mouse. A handle built into the top of the case made it easier for the computer to be lifted and carried."
		},
		{
			"galleryTitle": "Photorealistic Rendered Models",
			"galleryDescription": "These images have been rendered using V-Ray and used their advanced rendering engine alongside realistic materials and lighting."
		},
		{
			"CameraTitle": "Camera Views",
			"CameraSubtitle": "These buttons select a range of X3D model viewpoints"
		}
	],
	"models": [
		{
			"name": "iMac G3",
			"description": "The iMac G3, originally released as the iMac, is a series of Macintosh personal computers designed, manufactured, and sold by Apple Computer, Inc. from 1998 to 2003. Noted for its innovative enclosure via the use of translucent and brightly colored plastics, it was the first consumer-facing Apple product to debut under the recently returned interim CEO Steve Jobs. It was updated over time with new hardware and colors, until being supplanted by the iMac G4 and eMac.",
			"designedBy": "Jonathan Ive, with strong influence from Steve Jobs.",
			"imageUrl": "../assignment/application/assets/images/render_images/cropped/iMacG3RenderCropped.png",
			"modelNumber": "M5521 (EMC 1821)",
			"productionDate": "August 15, 1998",
			"releasePrice": "$1,299",
			"soundUrl": "../assignment/application/assets/audio/text-to-speech/imac-text-to-speech.mp3",
			"videoUrl": "../assignment/application/assets/videos/Apple iMac G3 Sage original TV Ad.mp4",
			"x3domUrl": "../assignment/application/assets/x3d/iMacG3.x3d"
		},
		{
			"name": "iPhone",
			"description": "The iPhone is the first smartphone designed and marketed by Apple Inc. After years of rumors and speculation, it was officially announced on January 9, 2007, and was later released in the United States on June 29, 2007. It featured quad-band GSM cellular connectivity with GPRS and EDGE support for data transfer. Development of the iPhone dated back to 2005, when former Apple CEO Steve Jobs conceived the idea. The design was expanded upon over the next 2 years in complete secrecy, before being announced in Q1 of 2007.",
			"designedBy": "Jonathan Ive",
			"imageUrl": "../assignment/application/assets/images/render_images/cropped/iPhonerenderImg.png",
			"modelNumber": "A1203",
			"productionDate": "June 29, 2007",
			"releasePrice": "$499",
			"soundUrl": "../assignment/application/assets/audio/text-to-speech/iphone-text-to-speech.mp3",
			"videoUrl": "../assignment/application/assets/videos/iPhone 2g Commercial _Hello_.mp4",
			"x3domUrl": "../assignment/application/assets/x3d/iPhone.x3d"
		},
		{
			"name": "Macintosh 128K",
			"description": "The Macintosh 128K, originally released as the Apple Macintosh, is the original Apple Macintosh personal computer. Its beige case consisted of a 9 in (23 cm) CRT monitor and came with a keyboard and mouse. A handle built into the top of the case made it easier for the computer to be lifted and carried. It had an initial selling price of $2,495 (equivalent to $6,140 in 2019). The Macintosh was introduced by the now-famous $370,000 (equivalent to $910,541 in 2019) television commercial by Ridley Scott, '1984', that aired on CBS during the third quarter of Super Bowl XVIII on January 22, 1984.",
			"designedBy": "Industrial designer Hartmut Esslinger, Steve Jobs",
			"imageUrl": "../assignment/application/assets/images/render_images/cropped/Macintoshrender.png",
			"modelNumber": "M0001",
			"productionDate": "January 24, 1984",
			"releasePrice": "$2,495",
			"soundUrl": "../assignment/application/assets/audio/text-to-speech/macintosh-text-to-speech.mp3",
			"videoUrl": "../assignment/application/assets/videos/1984 Apple Macintosh Mac Commercial.mp4",
			"x3domUrl": "../assignment/application/assets/x3d/Macintosh.x3d"
		},
		{
			"name": "iPod Classic",
			"description": "Apple introduced the first-generation iPod on October 23, 2001, with the slogan '1,000 songs in your pocket'. The first iPod had a monochrome LCD screen and featured a 5GB hard drive capable of storing 1,000 songs encoded using MP3. Among the iPod's innovations were its small size, achieved using a 1.8 inch hard drive, whereas its competitors were using 2.5 inch hard drives at the time, and its easy-to-use navigation, which was controlled using a mechanical scroll wheel (unlike later iPods, which had touch-sensitive scroll wheels), a center select button, and four auxiliary buttons around the wheel.",
			"designedBy": "Jon Rubinstein, Jonathan Ive, Tony Fadell",
			"imageUrl": "../assignment/application/assets/images/render_images/cropped/IpodrenderImg.png",
			"modelNumber": "M8541",
			"productionDate": "November 10, 2001",
			"releasePrice": "$399",
			"soundUrl": "../assignment/application/assets/audio/text-to-speech/ipod-text-to-speech.mp3",
			"videoUrl": "../assignment/application/assets/videos/iPod_ 1000 songs in your pocket.mp4",
			"x3domUrl": "../assignment/application/assets/x3d/iPod.x3d"
		}
	]
}